films = {
    'Магия': [
        ['Гарри Поттер и Философский Камень', 2001],
        ['Фантастические твари и где они обитают', 2016],
        ['Хроники Нарнии', 2005]
        ],
    'Фантастика': [
        ['Матрица', 1999],
        ['Господин Никто', 2000],
        ['Я - начало', 2014]
        ],
    'Космос': [
        ['Интерстеллар', 2014],
        ['Марсианин', 2015],
        ['Пассажиры', 2016]
    ],
    'Marvel': [
        ['Мстители: Война бесконечности', 2018],
        ['Дэдпул', 2016],
        ['Стражи галактики', 2014]
    ]
}


for ganre in films:
    print(ganre)
    for film_data in films[ganre]:
        print(f"\t{film_data[0]} -- {film_data[1]}")