films = {
    'Магия': [
            {'name':'Гарри Поттер и Философский Камень','year':2001},
            {'name':'Фантастические твари и где они обитают','year':2016},
            {'name':'Хроники Нарнии','year':2005}
        ],
    'Фантастика': [
            {'name':'Матрица','year':1999},
            {'name':'Господин Никто','year':2000},
            {'name':'Я - начало','year':2014}
        ],
    'Космос': [
            {'name':'Интерстеллар','year':2014},
            {'name':'Марсианин','year':2015},
            {'name':'Пассажиры','year':2016}
    ],
    'Marvel': [
            {'name':'Мстители: Война бесконечности','year':2018},
            {'name':'Дэдпул','year':2016},
            {'name':'Стражи галактики','year':2014}
    ]
}

for janre in films:
    print(janre)
    for film in films[janre]:
        print(f"\t{film['name']}  -  {film['year']}")