# Напишите программу, которая запишет в список все числа от 1 до n
# На вход программе подается число n

text = input("Введите предложение: ")
words = text.split()
print("*".join(words))