films = {
   'Магия': [
       ['Гарри Поттер и Философский Камень', 2001],
       ['Фантастические твари и где они обитают', 2016],
       ['Хроники Нарнии', 2005]
       ],
   'Фантастика': [
        {
            'name': 'Матрица',
            'age': 1999
        },
        {
            'name': 'Господин никто',
            'age': 2000
        },
        {
            'name': 'Я-начало',
            'age': 2014
        }
       ],
   'Космос': [
       'Интерстеллар',
       'Марсианин',
       'Пассажиры'
   ],
   'Marvel': [
       'Мстители: Война бесконечности',
       'Дэдпул',
       'Стражи галактики'
   ]
}


for i in films['Магия']:
    print(f'Название:{i[0]}\nгод выпуска:{i[1]}\n\n')


for i in films['Фантастика']:
    print(f"{i['name']} -- {i['age']}")