# name = 'булат'
# length = len(name)
# print(length)

# print(name + ', привет')
# print('_' * 40)


# print('2 + 2 = ' + str(2+2))
# print(f'2 + 2 = {2+2}')

# Уровень  Junior
# На вход программы подается строка текста. Выведите ее первый и последний символы в формате.

# Первые символ этой строки …
# Последний - …

# Уровень  Middle
# На вход подается строка текста. Придумайте, как вывести ее 100 раз, не используя более 3 строк кода

# Уровень  Senior
# На вход программе подаются три строки: имя, фамилия и отчество. Напишите программу, которая выводит инициалы человека.



name = input()
surname = input()
otchestvo = input()
print(name[0], surname[0], otchestvo[0])
