# text = "Easy Code"
# print(text[5:9])

# name1 = 'Булат'
# name2 = 'Герман'
# name3 = 'Павел'
# name4 = 'Артем'


# print(f'В моей команде:\n{name1}\n{name2}\n{name3}\n{name4}')


# text = '''Безусловно, экономическая повестка сегодняшнего дня играет определяющее значение для направлений прогрессивного развития.
# Учитывая ключевые сценарии поведения, постоянный количественный рост и сфера нашей активности позволяет оценить значение первоочередных требований.
# А ещё многие известные личности лишь добавляют фракционных разногласий и обнародованы.'''

# print(text)

# is_eat = input('Будете кушать? Да/Нет: ')
# print(is_eat)

# small_letters = is_eat.lower() # маленькие буквы
# print(small_letters)

# big_letters = is_eat.upper() # большие буквы
# print(big_letters)

text = 'Привет '
length = len(text)
print(length)


