[
{"name": "Сплав в Турции",
"description": "Хотите незабываемое приключение в Турции? Представляем вам наш уникальный тур в Турцию: 10 дней активного отдыха, наполненного приключениями и сплавом по захватывающим рекам. Откройте для себя потрясающие пейзажи, испытайте адреналин и насладитесь незабываемым опытом. Готовьтесь к удивительным впечатлениям и загорайте под теплыми лучами солнца Турции.",
"price": 148532,
"category": "активный отдых;море",
"country": "Турция",
"days": 10},

{"name": "Воздушные шары",
"description": "Погрузитесь в удивительное приключение в Турции! Отправляйтесь в незабываемый 7-дневный тур по Каппадокии, где вы сможете испытать невероятные ощущения полета на воздушных шарах. Почувствуйте адреналин и увидите потрясающие пейзажи этого магического места. Насладитесь комфортом и безопасностью нашего тура, который позволит вам полностью насладиться всей красотой Турции.",
"price": 71200,
"category": "активный отдых",
"country": "Турция",
"days": 7},

{"name": "Приключения на Мальдивах",
"description": "Забудьте о повседневной рутине и окунитесь в мир экзотической красоты с нашим туром на Мальдивы! Продолжительностью восемь дней, этот захватывающий приключенческий отдых предлагает не только незабываемые пляжные радости, но и возможность погрузиться в мир подводного дайвинга. Раскройте свои глаза для удивительного подводного мира, исследуйте коралловые рифы и встречайтесь с разнообразными морскими обитателями. Наш тур на Мальдивы - это опыт, который оставит след в сердце каждого любителя приключений!",
"price": 200000,
"category": "море",
"country": "Мальдивская Республика",
"days": 8},

{"name": "Египетский загар",
"description": "Готовьте паспорта и загорайте на белоснежных пляжах Египта! Наш 10-дневный тур включает в себя незабываемые экскурсии и расслабляющий пляжный отдых. Погрузитесь в древние культуры, посетите знаменитые пирамиды и интересные места, а затем отдохните на прекрасном побережье Красного моря. Наш профессиональный гид будет сопровождать вас на всех экскурсиях, чтобы вы получили самые яркие и запоминающиеся впечатления. Забудьте о повседневной рутине и отправляйтесь в незабываемое приключение в Египте!",
"price": 60000,
"category": "позагорать",
"country": "Египет",
"days": 10},

{"name": "Тур на Кипр",
"description": "Приглашаем вас на незабываемый отдых на Кипре! Забудьте о повседневных заботах и окунитесь в удивительный мир роскошных пляжей и живописных пейзажей Пафоса. Наш пятидневный тур предлагает идеальное сочетание спокойного отдыха и разнообразных развлечений. Насладитесь солнечными лучами, прогуляйтесь по узким улочкам города и попробуйте местные деликатесы. Успейте забронировать свое место на этом эксклюзивном туре уже сегодня и подарите себе незабываемые впечатления!",
"price": 98000,
"category": "позагорать",
"country": "Кипр",
"days": 5},

{"name": "Лови волну",
"description": "Устали от повседневной суеты? Отправьтесь в незабываемое приключение на Мальдивы с нашим туром 'Хождение под парусами'! Проведите 10 дней в роскошных условиях, путешествуя по кристально чистым водам на яхте. Насладитесь живописными видами островов, расслабьтесь на белоснежных пляжах и окунитесь в мир подводного красочного рая. Забудьте о заботах и позвольте себе истинное удовольствие на Мальдивах!",
"price": 178000,
"category": "море",
"country": "Мальдивская Република",
"days": 10},

{"name": "Подводный мир",
"description": "Хотите окунуться в подводный мир Мальдив? Предлагаем незабываемый 7-дневный тур на Мальдивы, включающий захватывающие погружения на подводной лодке! Откройте для себя удивительную подводную фауну и флору, не покидая комфорт своего судна. Насладитесь яркими коралловыми рифами, экзотическими рыбами и уникальными морскими созданиями. Наш тур обеспечит вам незабываемые впечатления и прекрасные фотографии для воспоминаний. Приготовьтесь к неповторимому приключению на Мальдивах!",
"price": 102000,
"category": "море",
"country": "Мальдивы",
"days": 7},

{"name": "Сёрфинг с мартышками",
"description": "Отправьтесь в увлекательное приключение на Шри Ланку с нашим 8-дневным туром, специально разработанным для любителей серфинга! Исследуйте волшебные пляжи, попробуйте свои силы на волнующих волнах и окунитесь в культуру и традиции этого удивительного острова. Наш опытный гид поможет вам открыть новые горизонты и создаст незабываемые впечатления. Включено проживание и транспортировка, чтобы вы могли сосредоточиться только на своем серфинге. Подарите себе незабываемый опыт на Шри Ланке!",
"price": 56000,
"category": "активный отдых;море",
"country": "Шри Ланка",
"days": 8},

{"name": "По следам Тарзана",
"description": "Погрузитесь в удивительный мир Африки с нашим эксклюзивным туром в Кению и Танзанию! Продолжительностью 12 дней, этот незабываемый путешествие сафари приведет вас в сердце самых потрясающих национальных парков. Встречайте бесчисленное разнообразие дикой природы, от удивительных животных до захватывающих пейзажей. Наши опытные гиды помогут вам раскрыть все тайны и красоты этого уникального континента. Подарите себе незабываемые приключения и ощутите дух Африки - бронируйте свой тур прямо сейчас!",
"price": 205000,
"category": "сафари",
"country": "Кения",
"days": 12},

{"name": "Дыхание Африки",
"description": "Приготовьтесь отправиться в незабываемое приключение! Наш тур в Африку предлагает уникальную возможность провести 12 дней в ЮАР, исследуя самую красивую и дикую природу этого региона. В рамках нашего путешествия вы посетите знаменитый национальный парк Крюгера, где сможете увидеть величественных животных в их естественной среде обитания. Захватывающие сафари станут незабываемым опытом для всех любителей природы и экзотических путешествий. Приглашаем вас присоединиться к этому захватывающему туру и ощутить дыхание Африки!",
"price": 179003,
"category": "сафари",
"country": "ЮАР",
"days": 12},

{"name": "Кенгуру и пауки",
"description": "Уникальный тур в Австралию, который превзойдет все ваши ожидания! Проведите 17 незабываемых дней, исследуя красоту этой удивительной страны. Погрузитесь в мир природы на острове Кенгуру, где вас ждут белоснежные пляжи, живописные леса и уникальная фауна. Ощутите адреналин сафари, поднявшись на джипе по бездорожью и встретив редких животных лицом к лицу. Отправьтесь в незабываемое приключение и откройте для себя прекрасную Австралию!",
"price": 198056,
"category": "сафари",
"country": "Австралия",
"days": 17},

{"name": "Природа и футбол",
"description": "Готовы отправиться в приключение своей мечты? Представляем вам незабываемый 14-дневный тур в Бразилию, который позволит вам окунуться в уникальную красоту Пантанала и испытать настоящий сафари опыт. Вас ждет захватывающая природа, разнообразие экзотических животных и незабываемые впечатления. Не упустите возможность открыть для себя эту уникальную часть мира с комфортом и стилем.",
"price": 67300,
"category": "сафари",
"country": "Бразилия",
"days": 14},

{"name": "Киты и пингвины",
"description": "Отправьтесь в незабываемое путешествие в Аргентину! Наш 12-дневный тур предлагает уникальную возможность посетить полуостров Вальдес и испытать настоящий сафари-опыт. Погрузитесь в мир дикой природы, наблюдая за китами, пингвинами и морскими львами. Откройте для себя живописные пейзажи и культуру этой удивительной страны. Ваше приключение начинается здесь!",
"price": 92000,
"category": "сафари",
"country": "Аргентина",
"days": 12},

{"name": "Египетская сила",
"description": "Устали от рутины и хотите погрузиться в удивительный мир Египта? Приготовьтесь к незабываемому приключению с нашим 7-дневным туром в Египет! Отправляйтесь в бедуинскую деревню, где вы сможете познакомиться с местной культурой и обычаями. А затем отправьтесь на захватывающее сафари, где вы будете разгадывать загадки пустыни и наслаждаться потрясающими видами. Готовы ли вы окунуться в мир приключений? Забронируйте свой тур в Египет прямо сейчас!",
"price": 78000,
"category": "сафари",
"country": "Египет",
"days": 7},

{"name": "Чистое море",
"description": "Готовы отправиться в незабываемое путешествие в Египет? Наш тур предлагает вам 7 дней удивительного отдыха на живописных пляжах с прекрасными видами и неповторимым подводным миром. Откройте для себя бескрайние коралловые рифы, окунитесь в теплые воды Красного моря и насладитесь уникальными возможностями для подводного плавания и сноркелинга. Отдыхайте, расслабляйтесь и наслаждайтесь кристально чистым морем - все это включено в нашем незабываемом туре.",
"price": 55000,
"category": "море",
"country": "Египет",
"days": 7},

{"name": "Карррамба!",
"description": "Готовы окунуться в атмосферу Испании? Наш 12-дневный тур в Испанию предлагает незабываемые впечатления от моря, пляжей и удивительной кухни. Проведите дни на солнечных пляжах, наслаждайтесь кристально чистым морем и попробуйте изысканные блюда испанской кухни. Наш экскурсионный гид проведет вас по самым живописным местам страны, чтобы вы полностью погрузились в ее культуру и атмосферу. Этот тур - идеальное сочетание релаксации и приключений для всех любителей испанского образа жизни!",
"price": 88000,
"category": "море",
"country": "Испания",
"days": 12},

{"name": "Роза Хутор",
"description": "Хотите незабываемый отдых на горнолыжных курортах России? Представляем вам наш эксклюзивный тур в Россию, который продлится 10 дней. Отправляйтесь в увлекательное снежное путешествие, наслаждайтесь кристально чистым воздухом и захватывающими видами горных пейзажей. Наша команда опытных гидов и инструкторов сделает ваше путешествие максимально комфортным и безопасным. Откройте для себя прекрасные горнолыжные трассы, расслабьтесь после активного дня в уютных гостиницах и насладитесь богатой культурной программой. Забронируйте свое путешествие в Розу Хутор уже сегодня и создайте незабываемые воспоминания!",
"price": 70000,
"category": "горы",
"country": "Россия",
"days": 10},

{"name": "Вниз по склону",
"description": "Готовы испытать незабываемое приключение? Представляем вам тур в Россию, специально созданный для любителей сноубординга! За 5 дней вы погрузитесь в мир безграничных горных просторов, снежных склонов и невероятных трасс. Наш опытный гид проведет вас через самые красивые локации, предоставляя все необходимое снаряжение и удобное размещение. Подарите себе море адреналина и новые яркие впечатления – бронируйте вашу поездку в Россию прямо сейчас!",
"price": 43000,
"category": "активный отдых;горы",
"country": "Россия",
"days": 5},

{"name": "Рай на Алтае",
"description": "Готовы отправиться в незабываемое приключение? Отправляйтесь в увлекательный 14-дневный тур в Россию, исследуя красоты Алтая и его самой высокой вершины - горы Белуха! Погрузитесь в окружающую природу и преодолейте пешие горные маршруты, наслаждаясь потрясающими пейзажами и уникальным богатством флоры и фауны. Это незабываемое путешествие оставит в вас глубокие впечатления и запомнится на всю жизнь.",
"price": 75000,
"category": "горы",
"country": "Россия",
"days": 14},

{"name": "Круассан на вершине",
"description": "Готовы отправиться в незабываемое путешествие? Представляем вам наш эксклюзивный тур во Францию, который превзойдет все ваши ожидания! За 10 дней вы сможете пройти незабываемый поход к величественной горе Монблан. Откройте для себя потрясающие пейзажи, переживите настоящее приключение и погрузитесь в культуру этой удивительной страны. Не упустите шанс испытать непередаваемые эмоции и создать яркие воспоминания. Забронируйте свое место уже сейчас и отправляйтесь на незабываемый тур в Францию!",
"price": 80123,
"category": "Франция",
"country": "горы",
"days": 10}
]
